artillery.yml
config:
  target: 'http://siagro01.conabio.gob.mx:3003/graphql'
  phases:
    - duration: 2
      arrivalRate: 1
  processor: './index.js'
scenarios:
  - name: 'GraphQL Query load test instance1'
    flow:
      - function: 'testInstance1'
      - loop:
          - post:
              url: '/'
              json:
                query: '{{ $loopElement.query }}'
          - log: "----------------------------------"
          - log: "Sent a request to the Query 1: {{ $loopElement.name }}"
        over: cases
  - name: 'GraphQL Query load test instance2'
    flow:
      - function: 'testInstance2'
      - loop:
          - post:
              url: '/'
              json:
                query: '{{ $loopElement.query }}'
          - log: "----------------------------------"
          - log: "Sent a request to the Query 2: {{ $loopElement.name }}"
        over: cases